notes/2.1-data-manipulation.org
 #+TITLE: Data Manipulation
#+PROPERTY: header-args    :tangle src/clj_d2l/data_manipulation.clj

* Data Manipulation

In order to get anything done, we need some way to store and
manipulate data. Generally, there are two important things we need
to do with data: (i) acquire them; and (ii) process them once they
are inside the computer. There is no point in acquiring data without
some way to store it, so let us get our hands dirty first by playing
with synthetic data. To start, we introduce the $n$-dimensional
array, which is also called the /ndarray/.

If you have worked with NumPy, the most widely-used scientific
computing package in Python, then you will find this section
familiar. No matter which framework you use, its tensor class
(/ndarray/ in MXNet, DJL and clj-djl, /Tensor/ in both PyTorch and
TensorFlow) is similar to NumPy's ndarray with a few killer
features. First, GPU is well-supported to accelerate the computation
whereas NumPy only supports CPU computation. Second, the tensor
class supports automatic differentiation. These properties make the
tensor class suitable for deep learning. Throughout the book, when
we say ndarrays, we are referring to instances of the ndarray class
unless otherwise stated.

