docs/2.1-data-manipulation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-11 Sun 15:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data Manipulation</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Data Manipulation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaa8ae78">1. Data Manipulation</a>
<ul>
<li><a href="#org271dad3">1.1. Getting Started</a></li>
<li><a href="#org15921db">1.2. Operations</a></li>
<li><a href="#org85308c5">1.3. Broadcasting Mechanism</a></li>
<li><a href="#orgedb4ae3">1.4. Indexing and Slicing</a></li>
<li><a href="#org5df5635">1.5. Saving Memory</a></li>
<li><a href="#orgcbb226c">1.6. Conversion to Other Clojure Objects</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgaa8ae78" class="outline-2">
<h2 id="orgaa8ae78"><span class="section-number-2">1</span> Data Manipulation</h2>
<div class="outline-text-2" id="text-1">
<p>
In order to get anything done, we need some way to store and
manipulate data. Generally, there are two important things we need
to do with data: (i) acquire them; and (ii) process them once they
are inside the computer. There is no point in acquiring data without
some way to store it, so let us get our hands dirty first by playing
with synthetic data. To start, we introduce the $n$-dimensional
array, which is also called the <i>ndarray</i>.
</p>

<p>
If you have worked with NumPy, the most widely-used scientific
computing package in Python, then you will find this section
familiar. No matter which framework you use, its tensor class
(<i>ndarray</i> in MXNet, DJL and clj-djl, <i>Tensor</i> in both PyTorch and
TensorFlow) is similar to NumPy's ndarray with a few killer
features. First, GPU is well-supported to accelerate the computation
whereas NumPy only supports CPU computation. Second, the tensor
class supports automatic differentiation. These properties make the
tensor class suitable for deep learning. Throughout the book, when
we say ndarrays, we are referring to instances of the ndarray class
unless otherwise stated.
</p>
</div>
