notes/2.1-data-manipulation.org
** Operations

#+begin_src clojure :results output :exports both
(d2l/ps (nd/create ndm (int-array [2 1 4 3]) (nd/shape [2 2])))
(d2l/ps (nd/create ndm [2 1 4 3] [2 2]))
(d2l/ps (nd/create ndm [(int 2) 1 4 3] [2 2]))
#+end_src

#+RESULTS:
#+begin_example
ND: (2, 2) cpu() int32
[[ 2,  1],
 [ 4,  3],
]
ND: (2, 2) cpu() int64
[[ 2,  1],
 [ 4,  3],
]
ND: (2, 2) cpu() int32
[[ 2,  1],
 [ 4,  3],
]
#+end_example

#+begin_src clojure :results output :exports both
(def x (nd/create ndm [1. 2 4 8] [2 2]))
(def y (nd/create ndm [2. 2 2 2] [2 2]))
(d2l/ps x)
(d2l/ps y)
(d2l/ps (nd/+ x y))
(d2l/ps (nd/- x y))
(d2l/ps (nd/* x y))
(d2l/ps (nd// x y))
(d2l/ps (nd/** x y))
(d2l/ps (nd/exp x))
#+end_src

#+RESULTS:
#+begin_example
ND: (2, 2) cpu() float64
[[1., 2.],
 [4., 8.],
]
ND: (2, 2) cpu() float64
[[2., 2.],
 [2., 2.],
]
ND: (2, 2) cpu() float64
[[ 3.,  4.],
 [ 6., 10.],
]
ND: (2, 2) cpu() float64
[[-1.,  0.],
 [ 2.,  6.],
]
ND: (2, 2) cpu() float64
[[ 2.,  4.],
 [ 8., 16.],
]
ND: (2, 2) cpu() float64
[[0.5, 1. ],
 [2. , 4. ],
]
ND: (2, 2) cpu() float64
[[ 1.,  4.],
 [16., 64.],
]
ND: (2, 2) cpu() float64
[[ 2.71828183e+00,  7.38905610e+00],
 [ 5.45981500e+01,  2.98095799e+03],
]
#+end_example

#+begin_src clojure :results output :exports both
(d2l/ps x)
(d2l/ps y)
(d2l/ps (nd/= x y))
#+end_src

#+RESULTS:
#+begin_example
ND: (2, 2) cpu() float64
[[1., 2.],
 [4., 8.],
]
ND: (2, 2) cpu() float64
[[2., 2.],
 [2., 2.],
]
ND: (2, 2) cpu() boolean
[[false,  true],
 [false, false],
]
#+end_example

#+begin_src clojure :results output :exports both
(def X (-> (nd/arange ndm 0 12) (nd/reshape [3 4])))
(def Y (nd/create ndm (int-array [2, 1, 4, 3, 1, 2, 3, 4, 4, 3, 2, 1]) [3 4]))
(d2l/ps (nd/concat X Y))
(d2l/ps (nd/concat X Y 0))
(d2l/ps (nd/concat X Y 1))
#+end_src

#+RESULTS:
#+begin_example
ND: (6, 4) cpu() int32
[[ 0,  1,  2,  3],
 [ 4,  5,  6,  7],
 [ 8,  9, 10, 11],
 [ 2,  1,  4,  3],
 [ 1,  2,  3,  4],
 [ 4,  3,  2,  1],
]
ND: (6, 4) cpu() int32
[[ 0,  1,  2,  3],
 [ 4,  5,  6,  7],
 [ 8,  9, 10, 11],
 [ 2,  1,  4,  3],
 [ 1,  2,  3,  4],
 [ 4,  3,  2,  1],
]
ND: (3, 8) cpu() int32
[[ 0,  1,  2,  3,  2,  1,  4,  3],
 [ 4,  5,  6,  7,  1,  2,  3,  4],
 [ 8,  9, 10, 11,  4,  3,  2,  1],
]
#+end_example

#+begin_src clojure :results output :exports both
(d2l/ps (nd/= X Y))
#+end_src

#+RESULTS:
: ND: (3, 4) cpu() boolean
: [[false,  true, false,  true],
:  [false, false, false, false],
:  [false, false, false, false],
: ]

#+begin_src clojure :results output :exports both
(d2l/ps (nd/sum X))
#+end_src

#+RESULTS:
: ND: () cpu() int32
: 66

