notes/2.1-data-manipulation.org
** Broadcasting Mechanism

#+begin_src clojure :results output :exports both
(def a (-> (nd/arange ndm 3) (nd/reshape [3 1])))
(d2l/ps a)
(def b (-> (nd/arange ndm 2) (nd/reshape [1 2])))
(d2l/ps b)
(d2l/ps (nd/+ a b))
#+end_src

#+RESULTS:
#+begin_example
ND: (3, 1) cpu() int32
[[ 0],
 [ 1],
 [ 2],
]
ND: (1, 2) cpu() int32
[[ 0,  1],
]
ND: (3, 2) cpu() int32
[[ 0,  1],
 [ 1,  2],
 [ 2,  3],
]
#+end_example


** Indexing and Slicing

#+begin_src clojure :results output :exports both
(d2l/ps X)
(d2l/ps (nd/get X "-1"))
(d2l/ps (nd/get X "1:3"))
(d2l/ps (nd/set X "1,2" 9))
(d2l/ps (nd/set X "0:2,:" 12))
#+end_src

#+RESULTS:
#+begin_example
ND: (3, 4) cpu() int32
[[ 0,  1,  2,  3],
 [ 4,  5,  6,  7],
 [ 8,  9, 10, 11],
]
ND: (4) cpu() int32
[ 8,  9, 10, 11]
ND: (2, 4) cpu() int32
[[ 4,  5,  6,  7],
 [ 8,  9, 10, 11],
]
ND: (3, 4) cpu() int32
[[ 0,  1,  2,  3],
 [ 4,  5,  9,  7],
 [ 8,  9, 10, 11],
]
ND: (3, 4) cpu() int32
[[12, 12, 12, 12],
 [12, 12, 12, 12],
 [ 8,  9, 10, 11],
]
#+end_example


** Saving Memory

#+begin_src clojure :results output :exports both
(def original (nd/zeros ndm (nd/get-shape X)))
(def actual (nd/+ original X))
(d2l/ps original)
(d2l/ps actual)
(d2l/psl (identical? original actual))
(def copy (nd/+! original X))
(d2l/ps original)
(d2l/ps copy)
(d2l/psl (identical? original copy))
#+end_src

#+RESULTS:
#+begin_example
ND: (3, 4) cpu() float32
[[0., 0., 0., 0.],
 [0., 0., 0., 0.],
 [0., 0., 0., 0.],
]
ND: (3, 4) cpu() float32
[[12., 12., 12., 12.],
 [12., 12., 12., 12.],
 [ 8.,  9., 10., 11.],
]
false
ND: (3, 4) cpu() float32
[[12., 12., 12., 12.],
 [12., 12., 12., 12.],
 [ 8.,  9., 10., 11.],
]
ND: (3, 4) cpu() float32
[[12., 12., 12., 12.],
 [12., 12., 12., 12.],
 [ 8.,  9., 10., 11.],
]
true
#+end_example

#+begin_src clojure :results output :exports both
(def original (nd/zeros-like X))
(def actual (nd/+ original X))
(d2l/ps original)
(d2l/ps actual)
(println (identical? original actual))
(def copy (nd/+! original X))
(d2l/ps original)
(d2l/ps copy)
(println (identical? original copy))
#+end_src

#+RESULTS:
#+begin_example
ND: (3, 4) cpu() int32
[[ 0,  0,  0,  0],
 [ 0,  0,  0,  0],
 [ 0,  0,  0,  0],
]
ND: (3, 4) cpu() int32
[[12, 12, 12, 12],
 [12, 12, 12, 12],
 [ 8,  9, 10, 11],
]
false
ND: (3, 4) cpu() int32
[[12, 12, 12, 12],
 [12, 12, 12, 12],
 [ 8,  9, 10, 11],
]
ND: (3, 4) cpu() int32
[[12, 12, 12, 12],
 [12, 12, 12, 12],
 [ 8,  9, 10, 11],
]
true
#+end_example

