notes/2.1-data-manipulation.org
** Conversion to Other Clojure Objects

#+begin_src clojure :results output :exports both

(d2l/psl (type (nd/to-vec X)))
(d2l/psl (nd/to-vec X))
(d2l/psl (type (nd/to-array X)))
(d2l/psl (type X))
(d2l/ps X)
#+end_src

#+RESULTS:
: class clojure.lang.PersistentVector
: [12 12 12 12 12 12 12 12 8 9 10 11]
: class [Ljava.lang.Integer;
: class ai.djl.mxnet.engine.MxNDArray
: ND: (3, 4) cpu() int32
: [[12, 12, 12, 12],
:  [12, 12, 12, 12],
:  [ 8,  9, 10, 11],
: ]

To convert a size-1 tensor to a scalar

#+begin_src clojure :results output :exports both
(def a (nd/create ndm [3.5]))
(d2l/ps a)
(println (nd/get-element a))
#+end_src

#+RESULTS:
: ND: (1) cpu() float64
: [3.5]
: 3.5
